Note
Access to this page requires authorization. You can trysigning inorchanging directories.
Access to this page requires authorization. You can trychanging directories.
Queries for the WindowsEvent table
Article
2025-04-14
2 contributors
In this article
For information on using these queries in the Azure portal, seeLog Analytics tutorial. For the REST API, seeQuery.
WindowsEvent Audit Policy Events
Display events where audits were cleared (EventId = 1102) or changed (EventId = 4719).
WindowsEvent
| where Provider == 'Microsoft-Windows-Security-Auditing' 
| where EventID == 1102 or EventID == 4719
| extend DescriptionMessage = iff(EventID == 1102, 'Audit log was cleared', 'System audit policy was changed')
| take 100
WindowsEvent
| where Provider == 'Microsoft-Windows-Security-Auditing' 
| where EventID == 1102 or EventID == 4719
| extend DescriptionMessage = iff(EventID == 1102, 'Audit log was cleared', 'System audit policy was changed')
| take 100
Feedback
Was this page helpful?
Additional resources