Note
Access to this page requires authorization. You can trysigning inorchanging directories.
Access to this page requires authorization. You can trychanging directories.
Visualize and monitor your data by using workbooks in Microsoft Sentinel
Article
2025-01-15
5 contributors
Applies to: Microsoft Sentinel in the Azure portal, Microsoft Sentinel in the Microsoft Defender portal
In this article
After you connect your data sources to Microsoft Sentinel, visualize and monitor the data using workbooks in Microsoft Sentinel. Microsoft Sentinel workbooks are based on Azure Monitor workbooks, and add tables and charts with analytics for your logs and queries to the tools already available in Azure.
Microsoft Sentinel allows you to create custom workbooks across your data or use existing workbook templates available with packaged solutions or as standalone content from the content hub. Each workbook is an Azure resource like any other, and you can assign it with Azure role-based access control (RBAC) to define and limit who can access.
This article describes how to visualize your data in Microsoft Sentinel by using workbooks.
Important
Microsoft Sentinel is generally available within Microsoft's unified security operations platform in the Microsoft Defender portal, including for customers without Microsoft Defender XDR or an E5 license. For more information, seeMicrosoft Sentinel in the Microsoft Defender portal.
Prerequisites
You must have at leastWorkbook readerorWorkbook contributorpermissions on the resource group of the Microsoft Sentinel workspace.The workbooks that you see in Microsoft Sentinel are saved within the Microsoft Sentinel workspace's resource group and are tagged by the workspace in which they were created.
You must have at leastWorkbook readerorWorkbook contributorpermissions on the resource group of the Microsoft Sentinel workspace.
The workbooks that you see in Microsoft Sentinel are saved within the Microsoft Sentinel workspace's resource group and are tagged by the workspace in which they were created.
To use a workbook template, install the solution that contains the workbook or install the workbook as a standalone item from theContent Hub. For more information, seeDiscover and manage Microsoft Sentinel out-of-the-box content.
To use a workbook template, install the solution that contains the workbook or install the workbook as a standalone item from theContent Hub. For more information, seeDiscover and manage Microsoft Sentinel out-of-the-box content.
Create a workbook from a template
Use a template installed from the content hub to create a workbook.
For Microsoft Sentinel in theAzure portal, underThreat management, selectWorkbooks.For Microsoft Sentinel in theDefender portal, selectMicrosoft Sentinel>Threat management>Workbooks.
For Microsoft Sentinel in theAzure portal, underThreat management, selectWorkbooks.For Microsoft Sentinel in theDefender portal, selectMicrosoft Sentinel>Threat management>Workbooks.
Go toWorkbooksand then selectTemplatesto see the list of workbook templates installed.To see which templates are relevant to the data types you connected, review theRequired data typesfield in each workbook where available.Azure portalDefender portal
Go toWorkbooksand then selectTemplatesto see the list of workbook templates installed.
To see which templates are relevant to the data types you connected, review theRequired data typesfield in each workbook where available.
Azure portal
Defender portal


SelectSavefrom the template details pane and the location where you want to save the JSON file for the template. This action creates an Azure resource based on the relevant template and saves the JSON file of the workbook not the data.
SelectSavefrom the template details pane and the location where you want to save the JSON file for the template. This action creates an Azure resource based on the relevant template and saves the JSON file of the workbook not the data.
SelectView saved workbookfrom the template details pane.
SelectView saved workbookfrom the template details pane.
Select theEditbutton in the workbook toolbar to customize the workbook according to your needs.For example, select theTimeRangefilter to view data for a different time range than the current selection. To edit a specific workbook area, either selectEditor select the ellipsis (...) to add elements, or move, clone, or remove the area.To clone your workbook, selectSave as. Save the clone with another name, under the same subscription and resource group. Cloned workbooks are displayed under theMy workbookstab.
Select theEditbutton in the workbook toolbar to customize the workbook according to your needs.

For example, select theTimeRangefilter to view data for a different time range than the current selection. To edit a specific workbook area, either selectEditor select the ellipsis (...) to add elements, or move, clone, or remove the area.
To clone your workbook, selectSave as. Save the clone with another name, under the same subscription and resource group. Cloned workbooks are displayed under theMy workbookstab.
When you're done, selectSaveto save your changes.
When you're done, selectSaveto save your changes.
For more information, see:
Create interactive reports with Azure Monitor Workbooks
Tutorial: Visual data in Log Analytics
Create new workbook
Create a workbook from scratch in Microsoft Sentinel.
For Microsoft Sentinel in theAzure portal, underThreat management, selectWorkbooks.For Microsoft Sentinel in theDefender portal, selectMicrosoft Sentinel>Threat management>Workbooks.
For Microsoft Sentinel in theAzure portal, underThreat management, selectWorkbooks.For Microsoft Sentinel in theDefender portal, selectMicrosoft Sentinel>Threat management>Workbooks.
SelectAdd workbook.
SelectAdd workbook.
To edit the workbook, selectEdit, and then add text, queries, and parameters as necessary. For more information on how to customize the workbook, see how toCreate interactive reports with Azure Monitor Workbooks.
To edit the workbook, selectEdit, and then add text, queries, and parameters as necessary. For more information on how to customize the workbook, see how toCreate interactive reports with Azure Monitor Workbooks.

When building a query, set theData sourcetoLogsandResource typetoLog Analytics, and then choose one or more workspaces.We recommend that your query uses anAdvanced Security Information Model (ASIM) parserand not a built-in table. The query will then support any current or future relevant data source rather than a single data source.
When building a query, set theData sourcetoLogsandResource typetoLog Analytics, and then choose one or more workspaces.
We recommend that your query uses anAdvanced Security Information Model (ASIM) parserand not a built-in table. The query will then support any current or future relevant data source rather than a single data source.
After you create your workbook, save the workbook under the subscription and resource group of your Microsoft Sentinel workspace.
After you create your workbook, save the workbook under the subscription and resource group of your Microsoft Sentinel workspace.
If you want to let others in your organization use the workbook, underSave toselectShared reports. If you want this workbook to be available only to you, selectMy reports.
If you want to let others in your organization use the workbook, underSave toselectShared reports. If you want this workbook to be available only to you, selectMy reports.
To switch between workbooks in your workspace, selectOpenin the toolbar of any workbook. The screen switches to a list of other workbooks you can switch to.Select the workbook you want to open:
To switch between workbooks in your workspace, selectOpenin the toolbar of any workbook. The screen switches to a list of other workbooks you can switch to.
Select the workbook you want to open:

Create new tiles for your workbooks
To add a custom tile to a Microsoft Sentinel workbook, first create the tile in Log Analytics. For more information, seeVisual data in Log Analytics.
Once you create a tile, selectPinand then select the workbook where you want the tile to appear.
Refresh your workbook data
Refresh your workbook to display updated data. In the toolbar, select one of the following options:
Refresh, to manually refresh your workbook data.
Refresh, to manually refresh your workbook data.
Auto refresh, to set your workbook to automatically refresh at a configured interval.Supported auto refresh intervals range from5 minutesto1 day.Auto refresh is paused while you're editing a workbook, and intervals are restarted each time you switch back to view mode from edit mode.Auto refresh intervals are also restarted if you manually refresh your data.By default, auto refresh is turned off. To optimize performance, auto refresh is turned off each time you close a workbook. It doesn't run in the background. Turn auto refresh back on as needed the next time you open the workbook.
Auto refresh, to set your workbook to automatically refresh at a configured interval.
Supported auto refresh intervals range from5 minutesto1 day.
Supported auto refresh intervals range from5 minutesto1 day.
Auto refresh is paused while you're editing a workbook, and intervals are restarted each time you switch back to view mode from edit mode.
Auto refresh is paused while you're editing a workbook, and intervals are restarted each time you switch back to view mode from edit mode.
Auto refresh intervals are also restarted if you manually refresh your data.
Auto refresh intervals are also restarted if you manually refresh your data.
By default, auto refresh is turned off. To optimize performance, auto refresh is turned off each time you close a workbook. It doesn't run in the background. Turn auto refresh back on as needed the next time you open the workbook.
Print a workbook or save as PDF
To print a workbook, or save it as a PDF, use the options menu to the right of the workbook title.
Select options >Print content.
Select options >Print content.
In the print screen, adjust your print settings as needed or selectSave as PDFto save it locally.For example:
In the print screen, adjust your print settings as needed or selectSave as PDFto save it locally.
For example:

How to delete workbooks
To delete a saved workbook, either a saved template or a customized workbook, select the saved workbook that you want to delete and selectDelete. This action removes the saved workbook. It also removes the workbook resource and any changes you made to the template. The original template remains available.
Workbook recommendations
This section reviews basic recommendations we have for using Microsoft Sentinel workbooks.
Add Microsoft Entra ID workbooks
If you use Microsoft Entra ID with Microsoft Sentinel, we recommend that you install the Microsoft Entra solution for Microsoft Sentinel and use the following workbooks:
Microsoft Entra sign-insanalyzes sign-ins over time to see if there are anomalies. This workbook provides failed sign-ins by applications, devices, and locations so that you can notice, at a glance if something unusual happens. Pay attention to multiple failed sign-ins.
Microsoft Entra audit logsanalyzes admin activities, such as changes in users (add, remove, etc.), group creation, and modifications.
Add firewall workbooks
We recommend that you install the appropriate solution from theContent hubto add a workbook for your firewall.
For example, install the Palo Alto firewall solution for Microsoft Sentinel to add the Palo Alto workbooks. The workbooks analyze your firewall traffic, providing you with correlations between your firewall data and threat events, and highlight suspicious events across entities.

Create different workbooks for different uses
We recommend creating different visualizations for each type of persona that uses workbooks, based on the persona's role and what they're looking for. For example, create a workbook for your network admin that includes the firewall data.
Alternately, create workbooks based on how frequently you want to look at them, whether there are things you want to review daily, and others items you want to check once an hour. For example, you might want to look at your Microsoft Entra sign-ins every hour to search for anomalies.
Sample query for comparing traffic trends across weeks
Use the following query to create a visualization that compares traffic trends across weeks. Switch the device vendor and data source you run the query on, depending on your environment.
The following sample query uses theSecurityEventtable from Windows. You might want to switch it to run on theAzureActivityorCommonSecurityLogtable, on any other firewall.
// week over week query
SecurityEvent
| where TimeGenerated > ago(14d)
| summarize count() by bin(TimeGenerated, 1d)
| extend Week = iff(TimeGenerated>ago(7d), "This Week", "Last Week"), TimeGenerated = iff(TimeGenerated>ago(7d), TimeGenerated, TimeGenerated + 7d)
// week over week query
SecurityEvent
| where TimeGenerated > ago(14d)
| summarize count() by bin(TimeGenerated, 1d)
| extend Week = iff(TimeGenerated>ago(7d), "This Week", "Last Week"), TimeGenerated = iff(TimeGenerated>ago(7d), TimeGenerated, TimeGenerated + 7d)
Sample query with data from multiple sources
You might want to create a query that incorporates data from multiples sources. For example, create a query that looks at Microsoft Entra audit logs for new users that were created, and then checks your Azure logs to see if the user started making role assignment changes within 24 hours of creation. That suspicious activity would show up in a visualization with the following query:
AuditLogs
| where OperationName == "Add user"
| project AddedTime = TimeGenerated, user = tostring(TargetResources[0].userPrincipalName)
| join (AzureActivity
| where OperationName == "Create role assignment"
| project OperationName, RoleAssignmentTime = TimeGenerated, user = Caller) on user
| project-away user1
AuditLogs
| where OperationName == "Add user"
| project AddedTime = TimeGenerated, user = tostring(TargetResources[0].userPrincipalName)
| join (AzureActivity
| where OperationName == "Create role assignment"
| project OperationName, RoleAssignmentTime = TimeGenerated, user = Caller) on user
| project-away user1
See more information on the following items used in the preceding examples, in the Kusto documentation:
whereoperator
extendoperator
projectoperator
project-awayoperator
joinoperator
summarizeoperator
ago()function
bin()function
iff()function
tostring()function
count()aggregation function
For more information on KQL, seeKusto Query Language (KQL) overview.
Other resources:
KQL quick reference
Kusto Query Language learning resources
Related articles
For more information, see:
Commonly used Microsoft Sentinel workbooks
Commonly used Microsoft Sentinel workbooks
Azure Monitor workbooks
Azure Monitor workbooks
Feedback
Was this page helpful?
Additional resources