Note
Access to this page requires authorization. You can trysigning inorchanging directories.
Access to this page requires authorization. You can trychanging directories.
Integrate Microsoft Defender for Cloud with Azure VMware Solution
Article
2024-02-28
8 contributors
In this article
Microsoft Defender for Cloud provides advanced threat protection across your Azure VMware Solution and on-premises virtual machines (VMs). It assesses the vulnerability of Azure VMware Solution VMs and raises alerts as needed. These security alerts can be forwarded to Azure Monitor for resolution. You can define security policies in Microsoft Defender for Cloud. For more information, seeWorking with security policies.
Microsoft Defender for Cloud offers many features, including:
File integrity monitoring
Fileless attack detection
Operating system patch assessment
Security misconfigurations assessment
Endpoint protection assessment
The diagram shows the integrated monitoring architecture of integrated security for Azure VMware Solution VMs.

Log Analytics agentcollects log data from Azure, Azure VMware Solution, and on-premises VMs. The log data is sent to Azure Monitor Logs and stored in aLog Analytics Workspace. Each workspace has its own data repository and configuration to store data.  Once the logs are collected,Microsoft Defender for Cloudassesses the vulnerability status of Azure VMware Solution VMs and raises an alert for any critical vulnerability. Once assessed, Microsoft Defender for Cloud forwards the vulnerability status to Microsoft Sentinel to create an incident and map with other threats.  Microsoft Defender for Cloud is connected to Microsoft Sentinel using Microsoft Defender for Cloud Connector.
Prerequisites
Plan for optimized use of Defender for Cloud.
Plan for optimized use of Defender for Cloud.
Review the supported platforms in Defender for Cloud.
Review the supported platforms in Defender for Cloud.
Create a Log Analytics workspaceto collect data from various sources.
Create a Log Analytics workspaceto collect data from various sources.
Enable Microsoft Defender for Cloud in your subscription.NoteMicrosoft Defender for Cloud is a pre-configured tool that doesn't require deployment, but you'll need to enable it.
Enable Microsoft Defender for Cloud in your subscription.
Note
Microsoft Defender for Cloud is a pre-configured tool that doesn't require deployment, but you'll need to enable it.
Enable Microsoft Defender for Cloud.
Enable Microsoft Defender for Cloud.
Add Azure VMware Solution VMs to Defender for Cloud
In the Azure portal, search onAzure Arcand select it.
In the Azure portal, search onAzure Arcand select it.
Under Resources, selectServersand then+Add.
Under Resources, selectServersand then+Add.

SelectGenerate script.
SelectGenerate script.

On thePrerequisitestab, selectNext.
On thePrerequisitestab, selectNext.
On theResource detailstab, fill in the following details and then selectNext. Tags:SubscriptionResource groupRegionOperating systemProxy Server details
On theResource detailstab, fill in the following details and then selectNext. Tags:
Subscription
Resource group
Region
Operating system
Proxy Server details
On theTagstab, selectNext.
On theTagstab, selectNext.
On theDownload and run scripttab, selectDownload.
On theDownload and run scripttab, selectDownload.
Specify your operating system and run the script on your Azure VMware Solution VM.
Specify your operating system and run the script on your Azure VMware Solution VM.
View recommendations and passed assessments
Recommendations and assessments provide you with the security health details of your resource.
In Microsoft Defender for Cloud, selectInventoryfrom the left pane.
In Microsoft Defender for Cloud, selectInventoryfrom the left pane.
For Resource type, selectServers - Azure Arc.
For Resource type, selectServers - Azure Arc.

Select the name of your resource. A page opens showing the security health details of your resource.
Select the name of your resource. A page opens showing the security health details of your resource.
UnderRecommendation list, select theRecommendations,Passed assessments, andUnavailable assessmentstabs to view these details.
UnderRecommendation list, select theRecommendations,Passed assessments, andUnavailable assessmentstabs to view these details.

Deploy a Microsoft Sentinel workspace
Microsoft Sentinel provides security analytics, alert detection, and automated threat response across an environment. It's a cloud-native, security information event management (SIEM) solution built on top of a Log Analytics workspace.
Since Microsoft Sentinel is built on top of a Log Analytics workspace, you only need to select the workspace you want to use.
In the Azure portal, search forMicrosoft Sentinel, and select it.
In the Azure portal, search forMicrosoft Sentinel, and select it.
On the Microsoft Sentinel workspaces page, select+Add.
On the Microsoft Sentinel workspaces page, select+Add.
Select the Log Analytics workspace and selectAdd.
Select the Log Analytics workspace and selectAdd.
Enable data collector for security events
On the Microsoft Sentinel workspaces page, select the configured workspace.
On the Microsoft Sentinel workspaces page, select the configured workspace.
Under Configuration, selectData connectors.
Under Configuration, selectData connectors.
Under the Connector Name column, selectSecurity Eventsfrom the list, then selectOpen connector page.
Under the Connector Name column, selectSecurity Eventsfrom the list, then selectOpen connector page.
On the connector page, select the events you wish to stream, then selectApply Changes.
On the connector page, select the events you wish to stream, then selectApply Changes.

Connect Microsoft Sentinel with Microsoft Defender for Cloud
On the Microsoft Sentinel workspace page, select the configured workspace.
On the Microsoft Sentinel workspace page, select the configured workspace.
Under Configuration, selectData connectors.
Under Configuration, selectData connectors.
SelectMicrosoft Defender for Cloudfrom the list, then selectOpen connector page.
SelectMicrosoft Defender for Cloudfrom the list, then selectOpen connector page.

SelectConnectto connect the Microsoft Defender for Cloud with Microsoft Sentinel.
SelectConnectto connect the Microsoft Defender for Cloud with Microsoft Sentinel.
EnableCreate incidentto generate an incident for Microsoft Defender for Cloud.
EnableCreate incidentto generate an incident for Microsoft Defender for Cloud.
Create rules to identify security threats
After connecting data sources to Microsoft Sentinel, you can create rules to generate alerts for detected threats. In the following example, we create a rule for attempts to sign in to Windows server with the wrong password.
On the Microsoft Sentinel overview page, under Configurations, selectAnalytics.
On the Microsoft Sentinel overview page, under Configurations, selectAnalytics.
Under Configurations, selectAnalytics.
Under Configurations, selectAnalytics.
Select+Createand on the drop-down, selectScheduled query rule.
Select+Createand on the drop-down, selectScheduled query rule.
On theGeneraltab, enter the required information and then selectNext: Set rule logic.NameDescriptionTacticsSeverityStatus
On theGeneraltab, enter the required information and then selectNext: Set rule logic.
Name
Description
Tactics
Severity
Status
On theSet rule logictab, enter the required information, then selectNext.Rule query (here showing our example query)SecurityEvent
|where Activity startswith '4625'
|summarize count () by IpAddress,Computer
|where count_ > 3Map entitiesQuery schedulingAlert thresholdEvent groupingSuppression
On theSet rule logictab, enter the required information, then selectNext.
Rule query (here showing our example query)SecurityEvent
|where Activity startswith '4625'
|summarize count () by IpAddress,Computer
|where count_ > 3
Rule query (here showing our example query)
SecurityEvent
|where Activity startswith '4625'
|summarize count () by IpAddress,Computer
|where count_ > 3
SecurityEvent
|where Activity startswith '4625'
|summarize count () by IpAddress,Computer
|where count_ > 3
Map entities
Map entities
Query scheduling
Query scheduling
Alert threshold
Alert threshold
Event grouping
Event grouping
Suppression
Suppression
On theIncident settingstab, enableCreate incidents from alerts triggered by this analytics ruleand selectNext: Automated response.
On theIncident settingstab, enableCreate incidents from alerts triggered by this analytics ruleand selectNext: Automated response.

SelectNext: Review.
SelectNext: Review.
On theReview and createtab, review the information, and selectCreate.
On theReview and createtab, review the information, and selectCreate.
Tip
After the third failed attempt to sign in to Windows server, the created rule triggers an incident for every unsuccessful attempt.
View alerts
You can view generated incidents with Microsoft Sentinel. You can also assign incidents and close them once they're resolved, all from within Microsoft Sentinel.
Go to the Microsoft Sentinel overview page.
Go to the Microsoft Sentinel overview page.
Under Threat Management, selectIncidents.
Under Threat Management, selectIncidents.
Select an incident and then assign it to a team for resolution.
Select an incident and then assign it to a team for resolution.

Tip
After resolving the issue, you can close it.
Hunt security threats with queries
You can create queries or use the available predefined query in Microsoft Sentinel to identify threats in your environment. The following steps run a predefined query.
On the Microsoft Sentinel overview page, under Threat management, selectHunting. A list of predefined queries is displayed.TipYou can also create a new query by selectingNew Query.
On the Microsoft Sentinel overview page, under Threat management, selectHunting. A list of predefined queries is displayed.
Tip
You can also create a new query by selectingNew Query.

Select a query and then selectRun Query.
Select a query and then selectRun Query.
SelectView Resultsto check the results.
SelectView Resultsto check the results.
Next steps
Now that you covered how to protect your Azure VMware Solution VMs, you can learn more about:
Using the workload protection dashboard
Advanced multistage attack detection in Microsoft Sentinel
Integrating Azure native services in Azure VMware Solution
Feedback
Was this page helpful?
Additional resources