Note
Access to this page requires authorization. You can trysigning inorchanging directories.
Access to this page requires authorization. You can trychanging directories.
Monitor Azure AD B2C with Azure Monitor
Article
2024-09-11
25 contributors
In this article
Use Azure Monitor to route Azure Active Directory B2C (Azure AD B2C) sign in andauditinglogs to different monitoring solutions. You can retain the logs for long-term use or integrate with third-party security information and event management (SIEM) tools to gain insights into your environment.
You can route log events to:
An Azurestorage account.
ALog Analytics workspace(to analyze data, create dashboards, and alert on specific events).
An Azureevent hub(and integrate with your Splunk and Sumo Logic instances).

When you plan to transfer Azure AD B2C logs to different monitoring solutions, or repository, consider that Azure AD B2C logs contain personal data. When you process such data, ensure you use appropriate security measures on the personal data. It includes protection against unauthorized or unlawful processing, using appropriate technical or organizational measures.
In this article, you learn how to transfer the logs to an Azure Log Analytics workspace. Then you can create a dashboard or create alerts that are based on Azure AD B2C users' activities.
Watch this video to learn how to configure monitoring for Azure AD B2C using Azure Monitor.
Deployment overview
Azure AD B2C usesMicrosoft Entra monitoring. Unlike Microsoft Entra tenants, an Azure AD B2C tenant can't have a subscription associated with it. So, we need to take extra steps to enable the integration between Azure AD B2C and Log Analytics, which is where we send the logs.
To enableDiagnostic settingsin Microsoft Entra ID within your Azure AD B2C tenant, you useAzure Lighthousetodelegate a resource, which allows your Azure AD B2C (theService Provider) to manage a Microsoft Entra ID (theCustomer) resource.
Tip
Azure Lighthouse is typically used to manage resources for multiple customers. However, it can also be used to manage resourceswithin an enterprise that has multiple Microsoft Entra tenants of its own, which is what we are doing here, except that we are only delegating the management of single resource group.
After you complete the steps in this article, you'll have created a new resource group (here calledazure-ad-b2c-monitor) and have access to that same resource group that contains theLog Analytics workspacein yourAzure AD B2Cportal. You'll also be able to transfer the logs from Azure AD B2C to your Log Analytics workspace.
During this deployment, you'll authorize a user or group in your Azure AD B2C directory to configure the Log Analytics workspace instance within the tenant that contains your Azure subscription. To create the authorization, you deploy anAzure Resource Managertemplate to the subscription that contains the Log Analytics workspace.
The following diagram depicts the components you'll configure in your Microsoft Entra ID and Azure AD B2C tenants.

During this deployment, you'll configure your Azure AD B2C tenant where logs are generated. You'll also configure Microsoft Entra tenant where the Log Analytics workspace will be hosted. The Azure AD B2C accounts used (such as your admin account) should be assigned theGlobal Administratorrole on the Azure AD B2C tenant. The Microsoft Entra account you'll use to run the deployment must be assigned theOwnerrole in the Microsoft Entra subscription. It's also important to make sure you're signed in to the correct directory as you complete each step as described.
In summary, you'll use Azure Lighthouse to allow a user or group in your Azure AD B2C tenant to manage a resource group in a subscription associated with a different tenant (the Microsoft Entra tenant). After this authorization is completed, the subscription and log analytics workspace can be selected as a target in the Diagnostic settings in Azure AD B2C.
Prerequisites
An Azure AD B2C account withGlobal Administratorrole on the Azure AD B2C tenant.
An Azure AD B2C account withGlobal Administratorrole on the Azure AD B2C tenant.
A Microsoft Entra account with theOwnerrole in the Microsoft Entra subscription. See how toAssign a user as an administrator of an Azure subscription.
A Microsoft Entra account with theOwnerrole in the Microsoft Entra subscription. See how toAssign a user as an administrator of an Azure subscription.
1. Create or choose resource group
First, create, or choose a resource group that contains the destination Log Analytics workspace that will receive data from Azure AD B2C. You'll specify the resource group name when you deploy the Azure Resource Manager template.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
Create a resource groupor choose an existing one. This example uses a resource group namedazure-ad-b2c-monitor.
2. Create a Log Analytics workspace
ALog Analytics workspaceis a unique environment for Azure Monitor log data. You'll use this Log Analytics workspace to collect data from Azure AD B2Caudit logs, and then visualize it with queries and workbooks, or create alerts.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
Create a Log Analytics workspace. This example uses a Log Analytics workspace namedAzureAdB2C, in a resource group namedazure-ad-b2c-monitor.
3. Delegate resource management
In this step, you choose your Azure AD B2C tenant as aservice provider. You also define the authorizations you need to assign the appropriate Azure built-in roles to groups in your Microsoft Entra tenant.
3.1 Get your Azure AD B2C tenant ID
First, get theTenant IDof your Azure AD B2C directory (also known as the directory ID).
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Azure AD B2C tenant from theDirectories + subscriptionsmenu.
SelectMicrosoft Entra ID, selectOverview.
Record theTenant ID.
3.2 Select a security group
Now select an Azure AD B2C group or user to which you want to give permission to the resource group you created earlier in the directory containing your subscription.
To make management easier, we recommend using Microsoft Entra usergroupsfor each role, allowing you to add or remove individual users to the group rather than assigning permissions directly to that user. In this walkthrough, we'll add a security group.
Important
In order to add permissions for a Microsoft Entra group, theGroup typemust be set toSecurity. This option is selected when the group is created. For more information, seeCreate a basic group and add members using Microsoft Entra ID.
WithMicrosoft Entra IDstill selected in yourAzure AD B2Cdirectory, selectGroups, and then select a group. If you don't have an existing group, create aSecuritygroup, then add members. For more information, follow the procedureCreate a basic group and add members using Microsoft Entra ID.
SelectOverview, and record the group'sObject ID.
3.3 Create an Azure Resource Manager template
To create the custom authorization and delegation in Azure Lighthouse, we use an Azure Resource Manager template. This template grants Azure AD B2C access to the Microsoft Entra resource group, which you created earlier, for example,azure-ad-b2c-monitor. Deploy the template from the GitHub sample by using theDeploy to Azurebutton, which opens the Azure portal and lets you configure and deploy the template directly in the portal. For these steps, make sure you're signed in to your Microsoft Entra tenant (not the Azure AD B2C tenant).
Sign in to theAzure portal.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
Use theDeploy to Azurebutton to open the Azure portal and deploy the template directly in the portal. For more information, seecreate an Azure Resource Manager template.
Use theDeploy to Azurebutton to open the Azure portal and deploy the template directly in the portal. For more information, seecreate an Azure Resource Manager template.

On theCustom deploymentpage, enter the following information:FieldDefinitionSubscriptionSelect the directory that contains the Azure subscription where theazure-ad-b2c-monitorresource group was created.RegionSelect the region where the resource will be deployed.Msp Offer NameA name describing this definition. For example,Azure AD B2C Monitoring. It's the name that will be displayed in Azure Lighthouse.  TheMSP Offer Namemust be unique in your Microsoft Entra ID. To monitor multiple Azure AD B2C tenants, use different names.Msp Offer DescriptionA brief description of your offer. For example,Enables Azure Monitor in Azure AD B2C.Managed By Tenant IDTheTenant IDof your Azure AD B2C tenant (also known as the directory ID).AuthorizationsSpecify a JSON array of objects that include the Microsoft Entra IDprincipalId,principalIdDisplayName, and AzureroleDefinitionId. TheprincipalIdis theObject IDof the B2C group or user that will have access to resources in this Azure subscription. For this walkthrough, specify the group's Object ID that you recorded earlier. For theroleDefinitionId, use thebuilt-in rolevalue for theContributor role,b24988ac-6180-42a0-ab88-20f7382dd24c.Rg NameThe name of the resource group you create earlier in your Microsoft Entra tenant. For example,azure-ad-b2c-monitor.The following example demonstrates an Authorizations array with one security group.[
  {
    "principalId": "<Replace with group's OBJECT ID>",
    "principalIdDisplayName": "Azure AD B2C tenant administrators",
    "roleDefinitionId": "b24988ac-6180-42a0-ab88-20f7382dd24c"
  }
]
On theCustom deploymentpage, enter the following information:
principalId
principalIdDisplayName
roleDefinitionId
principalId
roleDefinitionId
b24988ac-6180-42a0-ab88-20f7382dd24c
The following example demonstrates an Authorizations array with one security group.
[
  {
    "principalId": "<Replace with group's OBJECT ID>",
    "principalIdDisplayName": "Azure AD B2C tenant administrators",
    "roleDefinitionId": "b24988ac-6180-42a0-ab88-20f7382dd24c"
  }
]
[
  {
    "principalId": "<Replace with group's OBJECT ID>",
    "principalIdDisplayName": "Azure AD B2C tenant administrators",
    "roleDefinitionId": "b24988ac-6180-42a0-ab88-20f7382dd24c"
  }
]
After you deploy the template, it can take a few minutes (typically no more than five) for the resource projection to complete. You can verify the deployment in your Microsoft Entra tenant and get the details of the resource projection. For more information, seeView and manage service providers.
4. Select your subscription
After you've deployed the template and waited a few minutes for the resource projection to complete, follow these steps to associate your subscription with your Azure AD B2C directory.
Note
On thePortal settings | Directories + subscriptionspage, ensure that your Azure AD B2C and Microsoft Entra tenants are selected underCurrent + delegated directories.
Sign out of theAzure portaland sign back in with yourAzure AD B2Cadministrative account. This account must be a member of the security group you specified in theDelegate resource managementstep. Signing out and singing back in allows your session credentials to be refreshed in the next step.
Sign out of theAzure portaland sign back in with yourAzure AD B2Cadministrative account. This account must be a member of the security group you specified in theDelegate resource managementstep. Signing out and singing back in allows your session credentials to be refreshed in the next step.
Select theSettingsicon in the portal toolbar.
Select theSettingsicon in the portal toolbar.
On thePortal settings | Directories + subscriptionspage, in theDirectory namelist,  find your Microsoft Entra ID directory that contains the Azure subscription and theazure-ad-b2c-monitorresource group you created, and then selectSwitch.
On thePortal settings | Directories + subscriptionspage, in theDirectory namelist,  find your Microsoft Entra ID directory that contains the Azure subscription and theazure-ad-b2c-monitorresource group you created, and then selectSwitch.
Verify that you've selected the correct directory and your Azure subscription is listed and selected in theDefault subscription filter.
Verify that you've selected the correct directory and your Azure subscription is listed and selected in theDefault subscription filter.

5. Configure diagnostic settings
Diagnostic settings define where logs and metrics for a resource should be sent. Possible destinations are:
Azure storage account
Event hubssolutions
Log Analytics workspace
In this example, we use the Log Analytics workspace to create a dashboard.
5.1 Create diagnostic settings
You're ready tocreate diagnostic settingsin the Azure portal.
To configure monitoring settings for Azure AD B2C activity logs:
Sign in to theAzure portalwith yourAzure AD B2Cadministrative account. This account must be a member of the security group you specified in theSelect a security groupstep.
Sign in to theAzure portalwith yourAzure AD B2Cadministrative account. This account must be a member of the security group you specified in theSelect a security groupstep.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Azure AD B2C tenant from theDirectories + subscriptionsmenu.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Azure AD B2C tenant from theDirectories + subscriptionsmenu.
SelectMicrosoft Entra ID
SelectMicrosoft Entra ID
UnderMonitoring, selectDiagnostic settings.
UnderMonitoring, selectDiagnostic settings.
If there are existing settings for the resource, you'll see a list of settings already configured. Either selectAdd diagnostic settingto add a new setting, or selectEdit settingsto edit an existing setting. Each setting can have no more than one of each of the destination types.
If there are existing settings for the resource, you'll see a list of settings already configured. Either selectAdd diagnostic settingto add a new setting, or selectEdit settingsto edit an existing setting. Each setting can have no more than one of each of the destination types.

Give your setting a name if it doesn't already have one.
Give your setting a name if it doesn't already have one.
SelectAuditLogsandSignInLogs.
SelectAuditLogsandSignInLogs.
SelectSend to Log Analytics Workspace, and then:UnderSubscription, select your subscription.UnderLog Analytics Workspace, select the name of the workspace you created earlier such asAzureAdB2C.NoteOnly theAuditLogsandSignInLogsdiagnostic settings are currently supported for Azure AD B2C tenants.
SelectSend to Log Analytics Workspace, and then:
UnderSubscription, select your subscription.
UnderLog Analytics Workspace, select the name of the workspace you created earlier such asAzureAdB2C.
AzureAdB2C
Note
Only theAuditLogsandSignInLogsdiagnostic settings are currently supported for Azure AD B2C tenants.
SelectSave.
SelectSave.
Note
It can take up to 15 minutes after an event is emitted for it toappear in a Log Analytics workspace. Also, learn more aboutActive Directory reporting latencies, which can impact the staleness of data and play an important role in reporting.
If you see the error message,To set up Diagnostic settings to use Azure Monitor for your Azure AD B2C directory, you need to set up delegated resource management, make sure you sign in with a user who is a member of thesecurity groupandselect your subscription.
6. Visualize your data
Now you can configure your Log Analytics workspace to visualize your data and configure alerts. These configurations can be made in both your Microsoft Entra tenant and your Azure AD B2C tenant.
6.1 Create a Query
Log queries help you to fully use the value of the data collected in Azure Monitor Logs. A powerful query language allows you to join data from multiple tables, aggregate large sets of data, and perform complex operations with minimal code. Virtually any question can be answered and analysis performed as long as the supporting data has been collected, and you understand how to construct the right query. For more information, seeGet started with log queries in Azure Monitor.
Sign in to theAzure portal.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
FromLog Analytics workspacewindow, selectLogs
FromLog Analytics workspacewindow, selectLogs
In the query editor, paste the followingKusto Query Languagequery. This query shows policy usage by operation over the past x days. The default duration is set to 90 days (90d). Notice that the query is focused only on the operation where a token/code is issued by policy.AuditLogs
| where TimeGenerated  > ago(90d)
| where OperationName contains "issue"
| extend  UserId=extractjson("$.[0].id",tostring(TargetResources))
| extend Policy=extractjson("$.[1].value",tostring(AdditionalDetails))
| summarize SignInCount = count() by Policy, OperationName
| order by SignInCount desc  nulls last
In the query editor, paste the followingKusto Query Languagequery. This query shows policy usage by operation over the past x days. The default duration is set to 90 days (90d). Notice that the query is focused only on the operation where a token/code is issued by policy.
AuditLogs
| where TimeGenerated  > ago(90d)
| where OperationName contains "issue"
| extend  UserId=extractjson("$.[0].id",tostring(TargetResources))
| extend Policy=extractjson("$.[1].value",tostring(AdditionalDetails))
| summarize SignInCount = count() by Policy, OperationName
| order by SignInCount desc  nulls last
AuditLogs
| where TimeGenerated  > ago(90d)
| where OperationName contains "issue"
| extend  UserId=extractjson("$.[0].id",tostring(TargetResources))
| extend Policy=extractjson("$.[1].value",tostring(AdditionalDetails))
| summarize SignInCount = count() by Policy, OperationName
| order by SignInCount desc  nulls last
SelectRun. The query results are displayed at the bottom of the screen.
SelectRun. The query results are displayed at the bottom of the screen.
To save your query for later use, selectSave.
To save your query for later use, selectSave.

Fill in the following details:Name- Enter the name of your query.Save as- Selectquery.Category- SelectLog.
Fill in the following details:
Name- Enter the name of your query.
Save as- Selectquery.
query
Category- SelectLog.
Log
SelectSave.
SelectSave.
You can also change your query to visualize the data by using therenderoperator.
AuditLogs
| where TimeGenerated  > ago(90d)
| where OperationName contains "issue"
| extend  UserId=extractjson("$.[0].id",tostring(TargetResources))
| extend Policy=extractjson("$.[1].value",tostring(AdditionalDetails))
| summarize SignInCount = count() by Policy
| order by SignInCount desc  nulls last
| render  piechart
AuditLogs
| where TimeGenerated  > ago(90d)
| where OperationName contains "issue"
| extend  UserId=extractjson("$.[0].id",tostring(TargetResources))
| extend Policy=extractjson("$.[1].value",tostring(AdditionalDetails))
| summarize SignInCount = count() by Policy
| order by SignInCount desc  nulls last
| render  piechart

For more samples, see the Azure AD B2CSIEM GitHub repo.
6.2 Create a Workbook
Workbooks provide a flexible canvas for data analysis and the creation of rich visual reports within the Azure portal. They allow you to tap into multiple data sources from across Azure, and combine them into unified interactive experiences. For more information, seeAzure Monitor Workbooks.
Follow the instructions below to create a new workbook using a JSON Gallery Template. This workbook provides aUser InsightsandAuthenticationdashboard for Azure AD B2C tenant.
Sign in to theAzure portal.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
From theLog Analytics workspacewindow, selectWorkbooks.
From theLog Analytics workspacewindow, selectWorkbooks.
From the toolbar, select+ Newoption to create a new workbook.
From the toolbar, select+ Newoption to create a new workbook.
On theNew workbookpage, select theAdvanced Editorusing the</>option on the toolbar.
On theNew workbookpage, select theAdvanced Editorusing the</>option on the toolbar.

SelectGallery Template.
SelectGallery Template.
Replace the JSON in theGallery Templatewith the content fromAzure AD B2C basic workbook:
Replace the JSON in theGallery Templatewith the content fromAzure AD B2C basic workbook:
Apply the template by using theApplybutton.
Apply the template by using theApplybutton.
SelectDone Editingbutton from the toolbar to finish editing the workbook.
SelectDone Editingbutton from the toolbar to finish editing the workbook.
Finally, save the workbook by using theSavebutton from the toolbar.
Finally, save the workbook by using theSavebutton from the toolbar.
Provide aTitle, such asAzure AD B2C Dashboard.
Provide aTitle, such asAzure AD B2C Dashboard.
SelectSave.
SelectSave.

The workbook will display reports in the form of a dashboard.



Create alerts
Alerts are created by alert rules in Azure Monitor and can automatically run saved queries or custom log searches at regular intervals. You can create alerts based on specific performance metrics or when certain events occur. You can also create alerts on absence of an event, or when a number of events occur within a particular time window. For example, alerts can be used to notify you when average number of sign-ins exceeds a certain threshold. For more information, seeCreate alerts.
Use the following instructions to create a new Azure Alert, which will send anemail notificationwhenever there's a 25% drop in theTotal Requestscompared to previous period. Alert will run every 5 minutes and look for the drop in the last hour compared to the hour before it. The alerts are created using Kusto query language.
Sign in to theAzure portal.
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
FromLog Analytics workspace, selectLogs.
FromLog Analytics workspace, selectLogs.
Create a newKusto queryby using this query.let start = ago(2h);
let end = now();
let threshold = -25; //25% decrease in total requests.
AuditLogs
| serialize TimeGenerated, CorrelationId, Result
| make-series TotalRequests=dcount(CorrelationId) on TimeGenerated from start to end step 1h
| mvexpand TimeGenerated, TotalRequests
| serialize TotalRequests, TimeGenerated, TimeGeneratedFormatted=format_datetime(todatetime(TimeGenerated), 'yyyy-MM-dd [HH:mm:ss]')
| project   TimeGeneratedFormatted, TotalRequests, PercentageChange= ((toreal(TotalRequests) - toreal(prev(TotalRequests,1)))/toreal(prev(TotalRequests,1)))*100
| order by TimeGeneratedFormatted desc
| where PercentageChange <= threshold   //Trigger's alert rule if matched.
Create a newKusto queryby using this query.
let start = ago(2h);
let end = now();
let threshold = -25; //25% decrease in total requests.
AuditLogs
| serialize TimeGenerated, CorrelationId, Result
| make-series TotalRequests=dcount(CorrelationId) on TimeGenerated from start to end step 1h
| mvexpand TimeGenerated, TotalRequests
| serialize TotalRequests, TimeGenerated, TimeGeneratedFormatted=format_datetime(todatetime(TimeGenerated), 'yyyy-MM-dd [HH:mm:ss]')
| project   TimeGeneratedFormatted, TotalRequests, PercentageChange= ((toreal(TotalRequests) - toreal(prev(TotalRequests,1)))/toreal(prev(TotalRequests,1)))*100
| order by TimeGeneratedFormatted desc
| where PercentageChange <= threshold   //Trigger's alert rule if matched.
let start = ago(2h);
let end = now();
let threshold = -25; //25% decrease in total requests.
AuditLogs
| serialize TimeGenerated, CorrelationId, Result
| make-series TotalRequests=dcount(CorrelationId) on TimeGenerated from start to end step 1h
| mvexpand TimeGenerated, TotalRequests
| serialize TotalRequests, TimeGenerated, TimeGeneratedFormatted=format_datetime(todatetime(TimeGenerated), 'yyyy-MM-dd [HH:mm:ss]')
| project   TimeGeneratedFormatted, TotalRequests, PercentageChange= ((toreal(TotalRequests) - toreal(prev(TotalRequests,1)))/toreal(prev(TotalRequests,1)))*100
| order by TimeGeneratedFormatted desc
| where PercentageChange <= threshold   //Trigger's alert rule if matched.
SelectRun, to test the query. You should see the results if there's a drop of 25% or more in the total requests within the past hour.
SelectRun, to test the query. You should see the results if there's a drop of 25% or more in the total requests within the past hour.
To create an alert rule based on this query, use the+ New alert ruleoption available in the toolbar.
To create an alert rule based on this query, use the+ New alert ruleoption available in the toolbar.
On theCreate an alert rulepage, selectCondition name
On theCreate an alert rulepage, selectCondition name
On theConfigure signal logicpage, set following values and then useDonebutton to save the changes.Alert logic: SetNumber of resultsGreater than0.Evaluation based on: Select120for Period (in minutes) and5for Frequency (in minutes)
On theConfigure signal logicpage, set following values and then useDonebutton to save the changes.
Alert logic: SetNumber of resultsGreater than0.
Evaluation based on: Select120for Period (in minutes) and5for Frequency (in minutes)

After the alert is created, go toLog Analytics workspaceand selectAlerts. This page displays all the alerts that have been triggered in the duration set byTime rangeoption.
Configure action groups
Azure Monitor and Service Health alerts use action groups to notify users that an alert has been triggered. You can include sending a voice call, SMS, email; or triggering various types of automated actions. Follow the guidanceCreate and manage action groups in the Azure portal
Here's an example of an alert notification email.

Multiple tenants
To onboard multiple Azure AD B2C tenant logs to the same Log Analytics Workspace (or Azure storage account, or event hub), you'll need separate deployments with differentMsp Offer Namevalues. Make sure your Log Analytics workspace is in the same resource group as the one you configured inCreate or choose resource group.
When working with multiple Log Analytics workspaces, useCross Workspace Queryto create queries that work across multiple workspaces. For example, the following query performs a join of two Audit logs from different tenants based on the same Category (for example, Authentication):
workspace("AD-B2C-TENANT1").AuditLogs
| join  workspace("AD-B2C-TENANT2").AuditLogs
  on $left.Category== $right.Category
workspace("AD-B2C-TENANT1").AuditLogs
| join  workspace("AD-B2C-TENANT2").AuditLogs
  on $left.Category== $right.Category
Change the data retention period
Azure Monitor Logs are designed to scale and support collecting, indexing, and storing massive amounts of data per day from any source in your enterprise or deployed in Azure. By default, logs are retained for 30 days, but retention duration can be increased to up to two years. Learn how tomanage usage and costs with Azure Monitor Logs. After you select the pricing tier, you canChange the data retention period.
Disable monitoring data collection
To stop collecting logs to your Log Analytics workspace, delete the diagnostic settings you created. You'll continue to incur charges for retaining log data you've already collected into your workspace. If you no longer need the monitoring data you've collected, you can delete your Log Analytics workspace and the resource group you created for Azure Monitor. Deleting the Log Analytics workspace deletes all data in the workspace and prevents you from incurring additional data retention charges.
Delete Log Analytics workspace and resource group
Sign in to theAzure portal.
If you have access to multiple tenants, select theSettingsicon in the top menu to switch to your Microsoft Entra ID tenant from theDirectories + subscriptionsmenu.
Choose the resource group that contains the Log Analytics workspace. This example uses a resource group namedazure-ad-b2c-monitorand a Log Analytics workspace namedAzureAdB2C.
AzureAdB2C
Delete the Logs Analytics workspace.
Select theDeletebutton to delete the resource group.
Next steps
Find more samples in the Azure AD B2CSIEM gallery.
Find more samples in the Azure AD B2CSIEM gallery.
For more information about adding and configuring diagnostic settings in Azure Monitor, seeTutorial: Collect and analyze resource logs from an Azure resource.
For more information about adding and configuring diagnostic settings in Azure Monitor, seeTutorial: Collect and analyze resource logs from an Azure resource.
For information about streaming Microsoft Entra logs to an event hub, seeTutorial: Stream Microsoft Entra logs to an Azure event hub.
For information about streaming Microsoft Entra logs to an event hub, seeTutorial: Stream Microsoft Entra logs to an Azure event hub.
Feedback
Was this page helpful?
Additional resources